# Pandas

A dataframe is just pandas' version of a table. Tables have columns, which are reffered to as series. And multiple series make up a table. All stuff we know about data tables, just knowing specific termology.

In [1]:
import numpy as np
import pandas as pd

# Getting Data

In [ ]:
# Excel & CSV

data_file = 'your_file.csv'  # Can either be.xlsx or.csv
df = pd.read_csv(data_file)

In [ ]:
# Database
import pymysql

# Connect to the MySQL database
connection = pymysql.connect(
    host='your_host',
    user='your_user',
    password='your_password',
    database='your_database'
)

# Define your SQL query
sql_query = "SELECT * FROM your_table"

# Load data from MySQL into a DataFrame
df_mysql = pd.read_sql(sql_query, connection)

# Close the database connection when done
connection.close()

In [15]:
# Create a dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'San Francisco', 'Los Angeles']
}

# Convert the dictionary to a DataFrame
df = pd.DataFrame(data)

# Print the DataFrame
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [11]:
# Manual
import random
random.seed(42)


species = ['Lion', 'Tiger', 'Bear', 'Wolf', 'Eagle', 'Fox', 'Snake', 'Gorilla', 'Cheetah', 'Panda']
names = ['Leo', 'Stripe', 'Grizzly', 'Wiley', 'Aquila', 'Red', 'Serpent', 'Kong', 'Sprint', 'Bamboo']

# Generate random data for the DataFrame
data = {
    'Name':     random.sample(names, 10),                       # Randomly select 10 character names from the list
    'Species':  random.choices(species, k=10),                  # Randomly select 10 animal species
    'Level':    [random.randint(1, 10) for _ in range(10)],     # Random levels from 1 to 10
    'HP':       [random.randint(50, 100) for _ in range(10)],   # Random HP values
    'Attack':   [random.randint(10, 30) for _ in range(10)],    # Random attack values
    'Defense':  [random.randint(5, 20) for _ in range(10)],     # Random defense values
    'Speed':    [random.randint(1, 100) for _ in range(10)],    # Random Speed values (scaled to 1-100)
    'Vitality': [random.randint(1, 100) for _ in range(10)],    # Random Vitality values (scaled to 1-100)
    'Luck':     [random.randint(1, 100) for _ in range(10)],    # Random Luck values (scaled to 1-100)
    'Spirit':   [random.randint(1, 100) for _ in range(10)]     # Random Spirit values (scaled to 1-100)
}

# Create the DataFrame for animal characters
df_animals = pd.DataFrame(data)

# Displaying the DataFrame
df_animals

      Name  Species  Level  HP  Attack  Defense  Speed  Vitality  Luck  Spirit
0   Stripe     Lion      1  74      13        7     82        83    49       8
1      Leo     Lion      3  56      22        6     47        10    35      30
2   Aquila     Bear      7  72      12       12     21        78    82       5
3   Bamboo    Snake      6  72      27       14     48        82    89      41
4  Serpent      Fox      5  88      19        7     46        22    72      52
5      Red  Gorilla      3  66      30       12     27        69    29      35
6   Sprint  Gorilla      4  52      29        8     86        94    88       9
7  Grizzly    Eagle      6  96      21       17     35        32    42      28
8    Wiley    Eagle      2  79      28       13     90        21    99      73
9     Kong     Bear      2  84      16       19     88        60   100      92

In [4]:
# Creating a multi-index DataFrame
data = {'A': [1, 2, 3, 4],
        'B': [5, 6, 7, 8]}

index = pd.MultiIndex.from_tuples([('Group1', 'A'), ('Group1', 'B'), ('Group2', 'A'), ('Group2', 'B')])
df = pd.DataFrame(data, index=index)

df

          A  B
Group1 A  1  5
       B  2  6
Group2 A  3  7
       B  4  8

# Inspection

In [ ]:
# Show all columns
df.columns

In [ ]:
# Display first few rows
df.head(10)

# Summary statistics
df.describe().transpose()

# Checking for missing values
df.isnull().sum()

# Checking for duplicates
df.duplicated().sum()

# Selection

In [ ]:
# Selecting rows by index
row = df.loc[0]  # by label
row = df.iloc[0]  # by integer position

# Selecting multiple rows
rows = df.loc[1:2]  # by label
rows = df.iloc[1:3]  # by integer position

In [ ]:
# Selecting a single column
attribute = df['Name']

# Selecting multiple columns
attributes = df[['Name', 'Age']]

In [ ]:
# Conditional selection (Filtering)
young = df[df['Age'] < 30]

# Operations

## Cleaning & Processing

In [ ]:
# Removing rows with missing values
df_cleaned = df.dropna()

# Removing entire columns
df = df.drop('Column Name', axis=1)

# Filling missing values
df_filled = df.fillna(0)

# Removing duplicates
df_no_duplicates = df.drop_duplicates()

In [ ]:
# Converting a column to a different data type
df['Age'] = df['Age'].astype(float)

# Creating a DateTime object
date = pd.to_datetime('2023-09-14')

In [16]:
transport_types = ['Boat', 'Bus', 'Car', 'Train', 'Bike']

manualSeries = pd.Series(transport_types) # Python list to series.

manualSeries

0     Boat
1      Bus
2      Car
3    Train
4     Bike
dtype: object

In [ ]:
# Renaming columns
df.rename(columns={'Name': 'Full_Name', 'Age': 'Years'}, inplace=True)

In [ ]:
# Changing data types

# Inspecting the data types of each attribute
df.dtypes

# Example 1: Convert a Column to Numeric
data_numeric = {'Age': ['25', '30', '35', '40']}
df_numeric = pd.DataFrame(data_numeric)
df_numeric['Age'] = df_numeric['Age'].astype(int)

# Example 2: Convert a Column to Datetime
data_datetime = {'Date': ['2022-01-01', '2022-02-01', '2022-03-01']}
df_datetime = pd.DataFrame(data_datetime)
df_datetime['Date'] = pd.to_datetime(df_datetime['Date'])

# Example 3: Convert a Column to String
data_string = {'Number': [42, 3.14, 999]}
df_string = pd.DataFrame(data_string)
df_string['Number'] = df_string['Number'].astype(str)

# Example 4: Convert a Column to Categorical
data_categorical = {'Category': ['A', 'B', 'A', 'C', 'B']}
df_categorical = pd.DataFrame(data_categorical)
df_categorical['Category'] = df_categorical['Category'].astype('category')

# Example 5: Convert a Column to Boolean
data_boolean = {'Status': [True, False, True, False]}
df_boolean = pd.DataFrame(data_boolean)
df_boolean['Status'] = df_boolean['Status'].astype(bool)

### Splitting

In [18]:
# Splitting non missing and missing values

# Create a sample DataFrame with missing data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, np.nan, 35, 28, 30],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Miami']
}

df = pd.DataFrame(data)

# Create a boolean mask to identify rows with missing data in the 'Age' column
missing_age_mask = df['Age'].isnull()

# Create two DataFrames based on the boolean mask
no_missing_data_df = df[~missing_age_mask]  # Instances with no missing data
missing_data_df = df[missing_age_mask]      # Instances with missing data

# Display the DataFrames
print("Instances with no missing data:")
no_missing_data_df

Instances with no missing data:

      Name   Age         City
0    Alice  25.0     New York
2  Charlie  35.0  Los Angeles
3    David  28.0      Chicago
4      Eve  30.0        Miami

In [19]:
print("\nInstances with missing data:")
missing_data_df

Instances with missing data:

  Name  Age           City
1  Bob  NaN  San Francisco

## Manipulation

In [ ]:
# Sorting by a column
sorted_df = df.sort_values(by='Age', ascending=False)

# Conditional selection (Filtering)
young = df[df['Age'] < 30]
df.query('Age < 30', inplace=True)

# Grouping data by a column and calculating statistics
grouped = df.groupby('Category')
mean_values = grouped['Value'].mean()

In [14]:
data = pd.DataFrame({
    'Character_Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Character_Class': ['Mage', 'Warrior', 'Thief', 'Mage'],
    'Character_Level': [10, 15, 5, 12],
    'Character_HP': [80, 150, 60, 100]
})

# Define a custom function to categorize levels
def categorize_level(level):
    if level < 5:
        return 'Low'
    elif level >= 5 and level <= 10:
        return 'Medium'
    else:
        return 'High'

# Apply the categorize_level function to create a new column
data['Level_Category'] = data['Character_Level'].apply(categorize_level)


def categorize_class(character_class):
    if character_class in ['Mage', 'Wizard', 'Sorcerer']:
        return 'Magic User'
    else:
        return 'Melee Fighter'

data['Class_Category'] = data['Character_Class'].apply(categorize_class)

# Reorder
data = data[['Character_Name', 'Character_Class', 'Class_Category', 'Character_Level', 'Level_Category', 'Character_HP']]

data

,Character_Name,Character_Class,Class_Category,Character_Level,Level_Category,Character_HP
0,Alice,Mage,Magic User,10,Medium,80
1,Bob,Warrior,Melee Fighter,15,High,150
2,Charlie,Thief,Melee Fighter,5,Medium,60
3,David,Mage,Magic User,12,High,100

## Joining

In [ ]:
# Concatenating DataFrames vertically (Unioning)
df_concat = pd.concat([df1, df2])

# Merging DataFrames based on a common column (Joining)
merged_df = pd.merge(left=df1, right=df2, on='Key_Column')

In [4]:
# Sample DataFrames
data1 = {'key_column': [1, 2, 3, 4],
         'value1': ['A', 'B', 'C', 'D']}
df1 = pd.DataFrame(data1)

data2 = {'key_column': [2, 3, 5, 4],
         'value2': ['X', 'Y', 'Z', 'W']}
df2 = pd.DataFrame(data2)

# Performing an inner join
result = pd.merge(df1, df2, on='key_column', how='inner')

result

   key_column value1 value2
0           2      B      X
1           3      C      Y
2           4      D      W